/**
 * @name: regExp.js
 * @description: 常用到的正则集合
 * @author: xp
 * @create: 2020/07/31 13:54:06
 * @update: 2020/07/31 13:54:06
 */

const reg = {
	empty: /^\s*$/,
	phone: /^1\d{10}$/,
	telnum: /^1\d{10}$|^(\d{3,4}-?)?\d{7,8}$/,
	email: /^\w+[\w-+.]*@[\w-]+(\.[\w-]+)+$/,
	money1: /^[0-9]+(\.[0-9]{1,2})?$/,
	money: /^\d+(\.\d{1,2})?$/,
	integer: /^-?([1-9]\d*|0)$/,
	integer1: /^(-?|\+?)([1-9]\d*|0)$/,
	illegal: /[<>]/,
	percent: /^0$|^[1-9]\d?$|^100$/,
	url: /^((https?|ftp):\/\/)?[\w-]+\.[\w-]+(\.[\w-]+)*/, // 链接
	chinese: /^[\u4E00-\u9FFF]+$/, // 只有中文
	notchinese: /^[A-Za-z0-9]+$/, // 数字,字母
	IDnum: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/, // 身份证id
	num: /^\d+$|^\d+[.]?\d+$/, // 数字
	numBer: /[^/d]/g, // 数字
	bank: /^[0-9]{16,20}$/, // 数字16到20位
	numberPhone1: /^[0-9]{7,11}$/, // 数字7到11位
	numberPhone2: /^[0-9]{11,11}$/, // 数字11位
	numberPhone3: /^(13[0-9]|14[01456879]|15[0-35-9]|16[2567]|17[0-8]|18[0-9]|19[0-35-9])\d{8}$/
};
export default reg;
